import type { NextApiRequest, NextApiResponse } from 'next';
import { CityLocation } from '@/types';

const cityLocations: CityLocation[] = [
  {
    cityTude: '36.47998875747935,127.28919783143948',
    cityName: '세종특별시',
  },
  {
    cityTude: '35.17939914114983,129.07482873489005',
    cityName: '부산광역시',
  },
  {
    cityTude: '35.89239946163238,128.60119008276456',
    cityName: '대구광역시',
  },
  {
    cityTude: '37.455716624388444,126.70545133793712',
    cityName: '인천광역시',
  },
  {
    cityTude: '35.16003897253238,126.85171787916859',
    cityName: '광주광역시',
  },
  {
    cityTude: '36.274416807676545,127.24844639622525',
    cityName: '대전광역시/계룡시',
  },
  {
    cityTude: '35.53957781498731,129.31130528295765',
    cityName: '울산광역시',
  },
  {
    cityTude: '33.488999915906426,126.49844387076877',
    cityName: '제주도',
  },
  {
    cityTude: '37.263161134623665,127.0289389518513',
    cityName: '수원시',
  },
  {
    cityTude: '37.420020102775965,127.12680794365522',
    cityName: '성남시',
  },
  {
    cityTude: '37.738143057522215,127.03417141189983',
    cityName: '의정부시',
  },
  {
    cityTude: '37.39426608945488,126.95707508878607',
    cityName: '안양시',
  },
  {
    cityTude: '37.50346161897279,126.76618789231712',
    cityName: '부천시',
  },
  {
    cityTude: '37.47854944494946,126.86463654196449',
    cityName: '광명시',
  },
  {
    cityTude: '37.47854944494946,126.86463654196449',
    cityName: '평택시',
  },
  {
    cityTude: '37.47854944494946,126.86463654196449',
    cityName: '동두천시',
  },
  {
    cityTude: '37.321457551581666,126.83049698104341',
    cityName: '안산시',
  },
  {
    cityTude: '37.65846341869784,126.83214766751236 ',
    cityName: '고양시',
  },
  {
    cityTude: '37.39397754361563,126.9564767236094',
    cityName: '과천시',
  },
  {
    cityTude: '37.594307178524986,127.12977537642176',
    cityName: '구리시',
  },
  {
    cityTude: '37.63567070884509,127.21633652150142',
    cityName: '남양주시',
  },
  {
    cityTude: '37.14988633618659,127.07735545587319',
    cityName: '오산시',
  },
  {
    cityTude: '37.38007094874506,126.80245401359143 ',
    cityName: '시흥시',
  },
  {
    cityTude: '37.36138694701885,126.9355673633305',
    cityName: '군포시',
  },
  {
    cityTude: '37.34437094886485,126.96882922461987',
    cityName: '의왕시',
  },
  {
    cityTude: '37.539484278806306,127.21448554557695',
    cityName: '하남시',
  },
  {
    cityTude: '37.24117283315879,127.17715583112735',
    cityName: '용인시',
  },
  {
    cityTude: '37.75986282056044,126.7797843029802',
    cityName: '파주시',
  },
  {
    cityTude: '37.27210559810674,127.4350364869285',
    cityName: '이천시',
  },
  {
    cityTude: '37.27210559810674,127.4350364869285',
    cityName: '안성시',
  },
  {
    cityTude: '37.615471365172944,126.71601279984297',
    cityName: '김포시',
  },
  {
    cityTude: '37.19931326559011,126.83114218281312',
    cityName: '화성시',
  },
  {
    cityTude: '37.42915786152693,127.25442612681596',
    cityName: '광주시',
  },
  {
    cityTude: '37.78518746618932,127.04603348646914',
    cityName: '양주시',
  },
  {
    cityTude: '37.89487952445632,127.20020979745367',
    cityName: '포천시',
  },
  {
    cityTude: '37.29707048849024,127.63664022996134',
    cityName: '여주군',
  },
  {
    cityTude: '38.096329445793465,127.07537268706515',
    cityName: '연천군',
  },
  {
    cityTude: '37.83137544598633,127.50980032173985',
    cityName: '가평군',
  },
  {
    cityTude: '37.49170813361337,127.48757003371263',
    cityName: '양평군',
  },
  {
    cityTude: '37.88250605483191,127.73371369241603',
    cityName: '춘천시',
  },
  {
    cityTude: '37.49177131465959,127.98514990567773',
    cityName: '원주시/횡성군',
  },
  {
    cityTude: '37.16396678144958,128.98575796410043',
    cityName: '태백시',
  },
  {
    cityTude: '38.20775734845509,128.59177015868298',
    cityName: '속초시',
  },
  {
    cityTude: '37.69717201469456,127.8887182020151',
    cityName: '홍천군',
  },
  {
    cityTude: '37.18376859117502,128.46206704204909',
    cityName: '영월군',
  },
  {
    cityTude: '38.14677253934835,127.31307175124311',
    cityName: '철원군',
  },
  {
    cityTude: '38.1059026651001,127.70807719334891',
    cityName: '화천군',
  },
  {
    cityTude: '38.11003070519443,127.9901471398936',
    cityName: '양구군',
  },
  {
    cityTude: '38.06982431692087,128.1704707056762',
    cityName: '인제군',
  },
  {
    cityTude: '38.38050782537787,128.4679687326394',
    cityName: '고성군',
  },
  {
    cityTude: '38.07557444878916,128.61916215806343',
    cityName: '양양군',
  },
  {
    cityTude: '36.641731838148296,127.48894717118749',
    cityName: '청주시',
  },
  {
    cityTude: '36.99105098648744,127.92611270189194',
    cityName: '충주시',
  },
  {
    cityTude: '37.13267513431569,128.19109555746226',
    cityName: '제천시',
  },
  {
    cityTude: '36.48958183275781,127.72934393609418',
    cityName: '보은군',
  },
  {
    cityTude: '36.306533427517394,127.57151499399782',
    cityName: '옥천군',
  },
  {
    cityTude: '36.17500302228038,127.78373883205425',
    cityName: '영동군',
  },
  {
    cityTude: '36.85545823466195,127.43542776754163',
    cityName: '진천군',
  },
  {
    cityTude: '36.81547729275012,127.78681253412459',
    cityName: '괴산군',
  },
  {
    cityTude: '36.94025576261792,127.69015166055554',
    cityName: '음성군',
  },
  {
    cityTude: '36.98482510586274,128.36607508384137 ',
    cityName: '단양군',
  },
  {
    cityTude: '36.815114974932534,127.11413619034414',
    cityName: '천안시',
  },
  {
    cityTude: '36.446580716683826,127.11913762081114',
    cityName: '공주시',
  },
  {
    cityTude: '36.790051209484496,127.00266649329232',
    cityName: '아산시',
  },
  {
    cityTude: '36.78496113587975,126.45046104415384',
    cityName: '서산시',
  },
  {
    cityTude: '36.18730589336262,127.09852139254424',
    cityName: '논산시',
  },
  {
    cityTude: '36.274540697341365,127.24845791837275',
    cityName: '계룡시',
  },
  {
    cityTude: '36.2757335292883,126.90977618642388',
    cityName: '부여군',
  },
  {
    cityTude: '36.8895769630798,126.64554224602355',
    cityName: '당진시',
  },
  {
    cityTude: '35.82414371264899,127.14829554156702',
    cityName: '전주시',
  },
  {
    cityTude: '35.967452147826464,126.73663765511077',
    cityName: '군산시',
  },
  {
    cityTude: '35.948338944149015,126.95754383095812',
    cityName: '익산시',
  },
  {
    cityTude: '35.5699161689472,126.85586989367538',
    cityName: '정읍시',
  },
  {
    cityTude: '35.41628421663482,127.39029475392579',
    cityName: '남원시',
  },
  {
    cityTude: '35.803555189789996,126.8807569127621',
    cityName: '김제시',
  },
  {
    cityTude: '35.791791426230255,127.4249374691806',
    cityName: '진안군',
  },
  {
    cityTude: '36.00684645436402,127.66072317626278',
    cityName: '무주군',
  },
  {
    cityTude: '35.6474163326559,127.5215277896886',
    cityName: '장수군',
  },
  {
    cityTude: '35.617038300279035,127.28837371289032',
    cityName: '임실군',
  },
  {
    cityTude: '35.37451925953346,127.13765773121794',
    cityName: '순창군',
  },
  {
    cityTude: '35.435720606395186,126.70206246475765 ',
    cityName: '고창군',
  },
  {
    cityTude: '35.73168087283564,126.73305545906314',
    cityName: '부안군',
  },
  {
    cityTude: '34.81182810258267,126.39211843022434',
    cityName: '목포시',
  },
  {
    cityTude: '34.760388056774815,127.66265117165374',
    cityName: '여수시',
  },
  {
    cityTude: '34.9504943831087,127.48750048594297',
    cityName: '순천시',
  },
  {
    cityTude: '35.01581635538819,126.71093143570228',
    cityName: '나주시',
  },
  {
    cityTude: '34.94054994119634,127.69611462658894',
    cityName: '광양시',
  },
  {
    cityTude: '35.28201607020013,127.29205601397088',
    cityName: '곡성군',
  },
  {
    cityTude: '35.20251338028721,127.46261368623476',
    cityName: '구례군',
  },
  {
    cityTude: '34.60450406036898,127.275425487907',
    cityName: '고흥군',
  },
  {
    cityTude: '34.68166292929281,126.90696780281246',
    cityName: '장흥군',
  },
  {
    cityTude: '34.57392807442636,126.59953836226084',
    cityName: '해남군',
  },
  {
    cityTude: '34.799888497743495,126.69648127985262',
    cityName: '영암군',
  },
  {
    cityTude: '34.9903245569414,126.4816364730667',
    cityName: '무안군',
  },
  {
    cityTude: '35.06593929156306,126.51633086670734',
    cityName: '함평군',
  },
  {
    cityTude: '35.27721544572243,126.51194549838942',
    cityName: '영광군',
  },
  {
    cityTude: '35.30187622291298,126.7849573098344',
    cityName: '장성군',
  },
  {
    cityTude: '34.31086471919799,126.75536952338338',
    cityName: '완도군',
  },
  {
    cityTude: '34.4868163622048,126.26328190857893',
    cityName: '진도군',
  },
  {
    cityTude: '34.83315619508998,126.35132766491232',
    cityName: '신안군',
  },
  {
    cityTude: '36.018938624996075,129.34321280450584',
    cityName: '포항시',
  },
  {
    cityTude: '35.85624812532131,129.2249070600525',
    cityName: '경주시',
  },
  {
    cityTude: '36.139712609791324,128.113654768933',
    cityName: '김천시',
  },
  {
    cityTude: '36.56844593213384,128.72952282013077',
    cityName: '안동시',
  },
  {
    cityTude: '36.11966112627198,128.34346875791985',
    cityName: '구미시',
  },
  {
    cityTude: '36.805816288006724,128.62419050288923',
    cityName: '영주시',
  },
  {
    cityTude: '35.97317719910283,128.93847054365713',
    cityName: '영천시',
  },
  {
    cityTude: '36.410983652082464,128.15903703173203',
    cityName: '상주시',
  },
  {
    cityTude: '36.58654382997289,128.18670233448225',
    cityName: '문경시',
  },
  {
    cityTude: '35.82515307586793,128.7412025224521',
    cityName: '경산시',
  },
  {
    cityTude: '36.24294327689518,128.57274586734837',
    cityName: '군위군',
  },
  {
    cityTude: '36.35270275987966,128.69699453124872',
    cityName: '의성군',
  },
  {
    cityTude: '36.43624712418434,129.0571462778225',
    cityName: '청송군',
  },
  {
    cityTude: '36.666682927050346,129.11238947694662',
    cityName: '영양군',
  },
  {
    cityTude: '36.41506274365286,129.365445018262',
    cityName: '영덕군',
  },
  {
    cityTude: '35.647340380723584,128.73400326167467',
    cityName: '청도군',
  },
  {
    cityTude: '35.7261548678029,128.26299332350695',
    cityName: '고령군',
  },
  {
    cityTude: '35.99560363859963,128.40181766891894',
    cityName: '칠곡군',
  },
  {
    cityTude: '36.6469465872483,128.43752408566135',
    cityName: '예천군',
  },
  {
    cityTude: '36.89316793702317,128.73232797225782',
    cityName: '봉화군',
  },
  {
    cityTude: '36.993047125102535,129.40036659349394',
    cityName: '울진군',
  },
  {
    cityTude: '37.48435939045925,130.9058158702075',
    cityName: '울릉군',
  },
  {
    cityTude: '35.2278999320335,128.681558670698',
    cityName: '창원시',
  },
  {
    cityTude: '35.18028910677438,128.10790044351168',
    cityName: '진주시',
  },
  {
    cityTude: '34.854372878134,128.4329445950401',
    cityName: '통영시',
  },
  {
    cityTude: '35.00334501383852,128.06442080157572',
    cityName: '사천시',
  },
  {
    cityTude: '35.228658076689996,128.88916715513113',
    cityName: '김해시',
  },
  {
    cityTude: '35.50373253459872,128.74670269450343',
    cityName: '밀양시',
  },
  {
    cityTude: '34.880425495178955,128.62123003975196',
    cityName: '거제시',
  },
  {
    cityTude: '35.335108771619815,129.03705797787686',
    cityName: '양산시',
  },
  {
    cityTude: '35.322337439718666,128.26186621736883',
    cityName: '의령군',
  },
  {
    cityTude: '35.27239799399617,128.40652556654987',
    cityName: '함안군',
  },
  {
    cityTude: '35.54469061071787,128.4920966939172',
    cityName: '창녕군',
  },
  {
    cityTude: '38.38048667222461,128.4678595887036',
    cityName: '고성군',
  },
  {
    cityTude: '34.83768692111287,127.89249554754302',
    cityName: '남해군',
  },
  {
    cityTude: '35.06734407716096,127.75273356450353',
    cityName: '하동군',
  },
  {
    cityTude: '35.41548674042255,127.87346622145344',
    cityName: '산청군',
  },
  {
    cityTude: '35.520562284442065,127.72524125316968',
    cityName: '함양군',
  },
  {
    cityTude: '35.68668092278069,127.9095758570881',
    cityName: '거창군',
  },
  {
    cityTude: '35.5666694083926,128.16565404112296',
    cityName: '합천군',
  },
];

export default function handler(req: NextApiRequest, res: NextApiResponse<CityLocation[]>) {
  if (req.method === 'GET') {
    res.status(200).json(cityLocations);
  } else {
    res.setHeader('Allow', ['GET']);
    res.status(405).end(`Method ${req.method} Not Allowed`);
  }
}
